package target;

public class Bean {
    public void method() throws RuntimeException{
        /**
         *  execution ([접근제한자] 타입패턴1 [타입패턴2].이름패턴(타입패턴 | "..", ...)[throws 예외패턴]
         *  접근제한자 : public , protected, private 등이 올수 있고 생략이 가능하다.
         *  타입패턴1 : 리턴값의 타입을 나타내는 패턴이다.(해당 항목은 필수 값이다.), *을 이용해서 모든 패턴을 선택할 수도 있다.
         *  타입패턴2 : 패키지와 타입이름을 포함한 클래스의 패턴이다.(생략 가능하다), "*", ".." 을 이용해 여러개의 패키지를 선택할 수가 있다.
         *  이름패턴 : 메소드 이름패턴이다.(생략X)
         *  타입 패턴 : 메소드 파라미터의 타입 패턴이다(생략X, ..으로 모두 포함시킬수도 있다)
         *  예외 패턴 : 예외 이름에 대한 패턴으로 생략가능하다.
         */
        //

    }
}
